# ProjectionLinePatternId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
OverrideGraphicSettings..::..ProjectionLinePatternId Property
OverrideGraphicSettings Class See Also
---
Id of the projection surface line pattern.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public ElementId ProjectionLinePatternId { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ProjectionLinePatternId As ElementId
	Get
```

Visual C++
---
```text
public:
property ElementId^ ProjectionLinePatternId {
	ElementId^ get ();
}
```

# See Also
OverrideGraphicSettings Class
Autodesk.Revit.DB Namespace